src/cf/maERP_ib/src/Documents/Взаимодействие/Взаимодействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Взаимодействие</name>
  <attributes>
    <name>ЦентрКрасоты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГодовщины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <comment>Автор документа</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НапоминаниеИспользовать</name>
    <comment>Напоминать о задаче</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НапоминаниеРежим</name>
    <type>
      <types>EnumRef.ВариантыНапоминаний</types>
    </type>
  </attributes>
  <attributes>
    <name>НапоминаниеДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаОтработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/maERP_ib/src/Enums/ВариантыНапоминаний/ВариантыНапоминаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыНапоминаний</name>
  <enumValues>
    <name>ЧерезУказанноеВремя</name>
  </enumValues>
  <enumValues>
    <name>ПоСобытию</name>
  </enumValues>
  <enumValues>
    <name>ВУказанноеВремя</name>
  </enumValues>
  <enumValues>
    <name>ЗаВремяОтносительноСобытия</name>
  </enumValues>
</mdclass:Enum>

src/cf/maERP_ib/src/Enums/ВидыОперацийВзаимодействия/ВидыОперацийВзаимодействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВзаимодействия</name>
  <enumValues>
    <name>Встреча</name>
  </enumValues>
  <enumValues>
    <name>Дело</name>
  </enumValues>
  <enumValues>
    <name>Годовщина</name>
  </enumValues>
  <enumValues>
    <name>ТелефонныйЗвонокВходящий</name>
  </enumValues>
  <enumValues>
    <name>ТелефонныйЗвонокИсходящий</name>
  </enumValues>
</mdclass:Enum>

src/cf/maERP_ib/src/Documents/Взаимодействие/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
//Процедура, обработчик события "ПриИзменении"
//
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
//Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	Если Объект.Ссылка.Пустая() Тогда		
		Объект.ДатаНапоминания = ТекущаяДата();
	КонецЕсли;
	
	Элементы.РежимНапоминания.СписокВыбора.Очистить();
	Для Каждого ЭлементСписка Из Задачи.ЗадачаИсполнителя.ВернутьСписокРежимовНапоминания() Цикл
		Элементы.РежимНапоминания.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
		
	УстановитьВидимость();
	Элементы.ЦентрКрасотыНадпись.Заголовок = Объект.ЦентрКрасоты;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Установить текущий выбранный режим напоминания
	РежимНапоминания = Новый Структура("Режим, Интервал");
	Для Каждого Элемент ИЗ Элементы.РежимНапоминания.СписокВыбора Цикл
		Если Элемент.Значение.Режим = Объект.НапоминаниеРежим Тогда
			Если Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЧерезУказанноеВремя") Тогда
				Если Элемент.Значение.Интервал <> Объект.НапоминаниеДатаНачала - Объект.Дата Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия") Тогда
				НапоминаниеИнтервалДоНачала = Объект.ДатаНапоминания - Объект.НапоминаниеДатаНачала;					 				
			КонецЕсли;
			РежимНапоминания = Элемент.Значение;
			Прервать;			 
		КонецЕсли;
	КонецЦикла;
	
	ПроинициализироватьЭлементыВыбораВремени();
	ОбновитьКлиентскиеМетки(Истина);

КонецПроцедуры

&НаСервере
//Процедура выполняет установку видимости элементов
//
Процедура УстановитьВидимость()
	
	Элементы.Отработано.Пометка = Объект.ЗадачаОтработана;
	
	Элементы.ВидГодовщины.Видимость = ?(Объект.ВидОперации = Перечисления.ВидыОперацийВзаимодействия.Годовщина, Истина, Ложь);		
	Элементы.Тема.Видимость = Не Элементы.ВидГодовщины.Видимость;
	Элементы.ВремяНапоминания.Видимость = Не Элементы.ВидГодовщины.Видимость;
	Элементы.ГруппаПараметрыНапоминания.Доступность = Объект.НапоминаниеИспользовать;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийВзаимодействия.Встреча Тогда		
		Элементы.ФормаКнопкаЗаписатьИЗакрыть.Картинка = БиблиотекаКартинок.Встреча;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийВзаимодействия.Дело Тогда
		Элементы.ФормаКнопкаЗаписатьИЗакрыть.Картинка = БиблиотекаКартинок.Дело;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийВзаимодействия.Годовщина Тогда
		Элементы.ФормаКнопкаЗаписатьИЗакрыть.Картинка = БиблиотекаКартинок.Годовщина;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийВзаимодействия.ТелефонныйЗвонокВходящий Тогда
		Элементы.ФормаКнопкаЗаписатьИЗакрыть.Картинка = БиблиотекаКартинок.ТелефонныйЗвонокВходящий;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийВзаимодействия.ТелефонныйЗвонокИсходящий Тогда
		Элементы.ФормаКнопкаЗаписатьИЗакрыть.Картинка = БиблиотекаКартинок.ТелефонныйЗвонокИсходящий;
	КонецЕсли;
	
	Если Объект.НапоминаниеРежим = Перечисления.ВариантыНапоминаний.ЗаВремяОтносительноСобытия Тогда
		Элементы.ИнтервалДоНапоминания.Видимость = Истина;
		Элементы.ДатаНапоминанияЗадачи.Видимость = Ложь;
		Элементы.ВремяНапоминанияЗадачи.Видимость= Ложь;
	ИначеЕсли Объект.НапоминаниеРежим = Перечисления.ВариантыНапоминаний.ВУказанноеВремя Тогда 	
	    Элементы.ИнтервалДоНапоминания.Видимость = Ложь;
		Элементы.ДатаНапоминанияЗадачи.Видимость = Истина;
		Элементы.ВремяНапоминанияЗадачи.Видимость= Истина;
	ИначеЕсли Объект.НапоминаниеРежим = Перечисления.ВариантыНапоминаний.ПоСобытию Тогда 
		Элементы.ИнтервалДоНапоминания.Видимость = Ложь;
		Элементы.ВремяНапоминанияЗадачи.Видимость= Ложь;
		Элементы.ДатаНапоминанияЗадачи.Видимость = Ложь;
    ИначеЕсли Объект.НапоминаниеРежим = Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя Тогда 
		Элементы.ИнтервалДоНапоминания.Видимость = Ложь;
		Элементы.ВремяНапоминанияЗадачи.Видимость= Ложь;
		Элементы.ДатаНапоминанияЗадачи.Видимость = Ложь;
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//Процедура, обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НачалоДня(Объект.ДатаНапоминания) = Дата(01, 01, 01) Тогда
		Сообщить("Не заполнена дата напоминания");
		Отказ = Истина;
	КонецЕсли;
	
	Если Элементы.ВремяНапоминания.Видимость = Истина И (Объект.ДатаНапоминания - НачалоДня(Объект.ДатаНапоминания)) = 0 Тогда
		Сообщить("Не заполнено время напоминания");
		Отказ = Истина;
	КонецЕсли;
	
	Если Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия") Тогда
		Объект.НапоминаниеДатаНачала = Объект.ДатаНапоминания - НапоминаниеИнтервалДоНачала;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
//Процедура, обработчик события "НачалоВыбора"
//
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ТекущаяСтрока", Объект.Контрагент);
	Значение = ОткрытьФормуМодально("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты", ПараметрыОткрытия);
	
	Если Значение <> Неопределено Тогда
		Объект.Контрагент = Значение;
		ОбновитьКлиентскиеМетки(Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
//Процедура, обработчик события "ОбработкаВыбора"
//
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = "СоздатьНовогоКлиента" Тогда
		ДобавитьИВыбратьКонтрагента();
		ВыбранноеЗначение = Объект.Контрагент;
	Иначе 
		Объект.Контрагент = ВыбранноеЗначение;
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
//Процедура, обработчик команды ДобавитьИВыбратьКонтрагента
//
Процедура ДобавитьИВыбратьКонтрагента()
	
	ФормаКонтрагента = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты", Неопределено);
	ГруппаКлиентов = ВернутьГруппуКлиентов();
	ФормаКонтрагента.Объект.Родитель = ГруппаКлиентов;
	ФормаКонтрагента.ОткрытьМодально();
	
	Если Не ФормаКонтрагента.Объект.Ссылка.Пустая() Тогда
		Объект.Контрагент = ФормаКонтрагента.Объект.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//Функция возвращает группу клиентов
//
Функция ВернутьГруппуКлиентов()
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	НастройкиПользователей.Значение
	                      |ИЗ
	                      |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	                      |ГДЕ
	                      |	НастройкиПользователей.Пользователь = &Пользователь
	                      |	И НастройкиПользователей.ЦентрКрасоты = &ЦентрКрасоты
	                      |	И НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяГруппаКонтрагентов)");
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ЦентрКрасоты", ПараметрыСеанса.ТекущийЦентрКрасоты);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе 
		Возврат Справочники.Контрагенты.НайтиПоРеквизиту("Клиенты", Истина);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
//Процедура, обработчик события "АвтоПодбор"
//
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ОбщегоНазначенияСПАВызовСервера.НайтиКонтрагентовПоСтроке(Текст, 10, Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
//Процедура, обработчик события "ОкончаниеВводаТекста"
//
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ОбщегоНазначенияСПАВызовСервера.НайтиКонтрагентовПоСтроке(Текст, , Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
//Обработчик флага признака отработанности задачи
Процедура Отработано(Команда)
	
	//Записать док. закрыть форму
	Элементы.Отработано.Пометка = НЕ Элементы.Отработано.Пометка;
	Объект.ЗадачаОтработана = Элементы.Отработано.Пометка;
	
КонецПроцедуры

&НаКлиенте
//Обработчик изменения флага разрешения обработки напоминания
Процедура НапоминатьПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
//Обработка изменения режима напоминания
Процедура РежимНапоминанияПриИзменении(Элемент)
	
	Объект.НапоминаниеРежим = РежимНапоминания.Режим;
	
	Если Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия") И НЕ ЗначениеЗаполнено(Объект.НапоминаниеДатаНачала) Тогда
		Объект.НапоминаниеДатаНачала = Объект.ДатаНапоминания;
		
	ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ВУказанноеВремя") И НЕ ЗначениеЗаполнено(Объект.НапоминаниеДатаНачала) Тогда 	
		Объект.НапоминаниеДатаНачала = Объект.ДатаНапоминания;
		
	ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ПоСобытию") И НЕ ЗначениеЗаполнено(Объект.НапоминаниеДатаНачала) Тогда 
	    Объект.НапоминаниеДатаНачала = Дата(01,01,01,0,0,0);
		
    ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЧерезУказанноеВремя") Тогда 
		Объект.НапоминаниеДатаНачала = Объект.Дата + РежимНапоминания.Интервал; 
			
	КонецЕсли;
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
//При изменении даты напоминания
Процедура ПроинициализироватьЭлементыВыбораВремени()
	
	//Перезаполнить список выбора времени напоминания 
	МассивПериодов                 = Новый Массив;
	СтруктураВремени               = ОбщегоНазначенияСПАВызовСервера.ПолучитьВремяРаботыСтруктурнойЕдиницы(Объект.НапоминаниеДатаНачала, Объект.ЦентрКрасоты);
	СтруктураВремени.ДатаНачала    = ?(ЗначениеЗаполнено(СтруктураВремени.ДатаНачала),СтруктураВремени.ДатаНачала,Дата("00010101080000"));
	СтруктураВремени.ДатаОкончания = ?(ЗначениеЗаполнено(СтруктураВремени.ДатаОкончания),СтруктураВремени.ДатаОкончания,Дата("00010101220000"));
	
	МассивПериодов.Добавить(СтруктураВремени);	
	СписокВеремени = РаботаСДиалогами.ВернутьСписокВремени(МассивПериодов, Истина);	
	
	Элементы.ВремяНапоминанияЗадачи.СписокВыбора.Очистить();
	Для Каждого Элемент ИЗ СписокВеремени Цикл	
	     Элементы.ВремяНапоминанияЗадачи.СписокВыбора.Добавить(Элемент.Значение,Элемент.Представление);
	КонецЦикла;
	 
	Элементы.ВремяНапоминания.СписокВыбора.Очистить();
	Для Каждого Элемент ИЗ СписокВеремени Цикл	
	     Элементы.ВремяНапоминания.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ВремяНапоминанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.ДатаНапоминания = НачалоДня(Объект.ДатаНапоминания) + (ВыбранноеЗначение - НачалоДня(ВыбранноеЗначение));
	
КонецПроцедуры


&НаКлиенте
Процедура ВремяНапоминанияЗадачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.НапоминаниеДатаНачала = НачалоДня(Объект.НапоминаниеДатаНачала) + (ВыбранноеЗначение - НачалоДня(ВыбранноеЗначение));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Записать();
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ЦентрКрасотыНадписьНажатие(Элемент)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь", Истина);
    СтруктураПараметров.Вставить("Ссылка", ОбщегоНазначенияСПАВызовСервера.ДоступныеСтруктурныеЕдиницы()); 
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
	Структура = ОткрытьФормуМодально("Справочник.ЦентрыКрасоты.ФормаВыбора", СтруктураПараметров);	
	Если Структура <> Неопределено Тогда
	   Если Объект.ЦентрКрасоты <> Структура Тогда
	     Объект.ЦентрКрасоты = Структура;
	     Элементы.ЦентрКрасотыНадпись.Заголовок = Объект.ЦентрКрасоты;
	   КонецЕсли;
   КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
//ОБРАБОТЧИКИ МЕХАНИЗМА КЛИЕНТСКИХ МЕТОК

&НаКлиенте
// Обработчик команды редактирвоания состава меток
//
Процедура ОбработчикРедактированияМеток(Команда)
	
	ОбщегоНазначенияСПАКлиент.ОбработчикКомандыРедактированияМеток(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
// Обновить клиентские метки, вернуть текстовое сообщение о метках
//
Функция ОбновитьКлиентскиеМетки(ВывестиСообщение)
	
	Временная        = Объект.Контрагент;
	ВывестиСообщение = ?(ОбновитьКлиентскиеМеткиСервер()<>"",ВывестиСообщение,Ложь);
	
	Если ВывестиСообщение Тогда
		ОткрытьФормуМодально("РегистрСведений.МеткиКлиентов.Форма.ФормаОповещенияОМетках",Новый Структура("Клиент, Период",Временная,Объект.Дата));
	КонецЕсли;
	
КонецФункции

&НаСервере
// Обновить клиентские метки, вернуть текстовое сообщение о метках
//
Функция ОбновитьКлиентскиеМеткиСервер()
	
	Возврат РегистрыСведений.МеткиКлиентов.ОбновитьМеткиНаФормеДокументаВернутьОповещение(ЭтаФорма);
	
КонецФункции


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Обновление меток клиента
	Если ИмяСобытия = "ОБНОВЛЕНЫ_МЕТКИ_КЛИЕНТА" Тогда
		ОбновитьКлиентскиеМетки(Ложь);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
   ОбновитьКлиентскиеМетки(Истина);	
КонецПроцедуры
